[
    {
        "title": "HTML",
        "image": "https://deisishop.pythonanywhere.com/media/produto_imagens/do-not-disturb.png",
        "description": "HTML (HyperText Markup Language) é uma linguagem de marcação utilizada para estruturar e apresentar conteúdo na web. Ele não é uma linguagem de programação, mas sim uma forma de organizar textos, imagens, vídeos e outros elementos em páginas web. O HTML funciona como a base de qualquer site, formando sua estrutura principal.",
        "rating": 3.5
    },
    {
        "title": "CSS",
        "image": "https://deisishop.pythonanywhere.com/media/produto_imagens/do-not-disturb.png",
        "description": "CSS (Cascading Style Sheets) é uma linguagem de estilo utilizada para descrever a apresentação de documentos HTML. Ele controla a aparência e o layout de páginas web, incluindo cores, fontes e posicionamento.",
        "rating": 4.0
    },
    {
        "title": "JavaScript",
        "image": "https://deisishop.pythonanywhere.com/media/produto_imagens/do-not-disturb.png",
        "description": "JavaScript é uma linguagem de programação que permite adicionar interatividade e funcionalidades dinâmicas a páginas web. Ele é essencial para o desenvolvimento front-end e pode ser usado no back-end com Node.js.",
        "rating": 3.5
    },
    {
        "title": "JSON",
        "image": "https://deisishop.pythonanywhere.com/media/produto_imagens/do-not-disturb.png",
        "description": "JSON (JavaScript Object Notation) é um formato leve de troca de dados, fácil de ler e escrever por humanos e fácil de interpretar e gerar por máquinas.",
        "rating": 4.0
    },
    {
        "title": "API RESTful",
        "image": "https://deisishop.pythonanywhere.com/media/produto_imagens/do-not-disturb.png",
        "description": "APIs RESTful seguem o padrão REST (Representational State Transfer), permitindo comunicação eficiente entre sistemas via HTTP, utilizando métodos como GET, POST, PUT e DELETE.",
        "rating": 4.0
    },
    {
        "title": "Swagger",
        "image": "https://deisishop.pythonanywhere.com/media/produto_imagens/do-not-disturb.png",
        "description": "Swagger é um conjunto de ferramentas para design, documentação e teste de APIs RESTful, facilitando o desenvolvimento e a integração de APIs.",
        "rating": 3.5
    },
    {
        "title": "GitHub",
        "image": "https://deisishop.pythonanywhere.com/media/produto_imagens/do-not-disturb.png",
        "description": "GitHub é uma plataforma de hospedagem de código baseada em Git. Ele permite controle de versão, colaboração em equipe e deploy de projetos.",
        "rating": 5.0
    },
    {
        "title": "Codespaces",
        "image": "https://deisishop.pythonanywhere.com/media/produto_imagens/do-not-disturb.png",
        "description": "Codespaces é um ambiente de desenvolvimento na nuvem oferecido pelo GitHub, que permite configurar e usar ambientes de desenvolvimento em poucos minutos.",
        "rating": 5.0
    },
    {
        "title": "GitHub Pages",
        "image": "https://deisishop.pythonanywhere.com/media/produto_imagens/do-not-disturb.png",
        "description": "GitHub Pages é um serviço que permite hospedar sites diretamente de um repositório GitHub, ideal para páginas pessoais, documentações e portfólios.",
        "rating": 4.5
    },
    {
        "title": "React.js",
        "image": "https://deisishop.pythonanywhere.com/media/produto_imagens/do-not-disturb.png",
        "description": "React.js é uma biblioteca JavaScript para construir interfaces de usuário. Criado pelo Facebook, ele é conhecido por seu desempenho e modularidade.",
        "rating": 3.5
    },
    {
        "title": "Next.js",
        "image": "https://deisishop.pythonanywhere.com/media/produto_imagens/do-not-disturb.png",
        "description": "Next.js é um framework React que oferece funcionalidades como renderização no servidor, geração de sites estáticos e roteamento simplificado.",
        "rating": 4.0
    },
    {
        "title": "Vercel",
        "image": "https://deisishop.pythonanywhere.com/media/produto_imagens/do-not-disturb.png",
        "description": "Vercel é uma plataforma de deploy para sites e aplicações web, otimizada para frameworks modernos como Next.js. Ela oferece deploy rápido e integração contínua.",
        "rating": 1.0
    }
]